&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    //// 1. ДОБАВИТЬ РЕКВИЗИТ в форму (ЕСЛИ ЕГО НЕТ)
    ДобавляемыеРеквизиты = Новый Массив;
    Если НЕ ЕстьРеквизитФормы("ВКМ_СуммаАбонентскойПлаты") Тогда
        Реквизит = Новый РеквизитФормы("ВКМ_СуммаАбонентскойПлаты", Новый ОписаниеТипов("Число", , 
            Новый КвалификаторыЧисла(15,2)), , "Сумма абон. платы");
        ДобавляемыеРеквизиты.Добавить(Реквизит);
        ИзменитьРеквизиты(ДобавляемыеРеквизиты);
    КонецЕсли;
    Если Элементы.Найти("ГруппаПрограммноСозданныеЭлементыФормы") = Неопределено Тогда
		ГруппаПрограммноСозданныеЭлементыФормы = Элементы.Добавить("ГруппаПрограммноСозданныеЭлементыФормы", Тип("ГруппаФормы"),ЭтотОбъект);
		ГруппаПрограммноСозданныеЭлементыФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаПрограммноСозданныеЭлементыФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		ГруппаПрограммноСозданныеЭлементыФормы.ОтображатьЗаголовок = Ложь;
		ГруппаПрограммноСозданныеЭлементыФормы.Отображение = ОтображениеОбычнойГруппы.Нет; 
	КонецЕсли;
    // 2. ДОБАВИТЬ ЭЛЕМЕНТ (если нет)
    Если Элементы.Найти("ВКМ_СуммаАбонентскойПлаты") = Неопределено Тогда
        НовыйЭлемент = Элементы.Добавить("ВКМ_СуммаАбонентскойПлаты", Тип("ПолеФормы"), 
            ГруппаПрограммноСозданныеЭлементыФормы);
        НовыйЭлемент.ПутьКДанным = "ВКМ_СуммаАбонентскойПлаты";
        НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
        НовыйЭлемент.Заголовок = "Сумма абонентской платы";
    
    КонецЕсли;
     Элементы.ВидДоговора.УстановитьДействие("ПриИзменении", "ВКМ_СуммаАбонентскойПлатыПриИзменении");
	
КонецПроцедуры

&НаСервере
Функция ЕстьРеквизитФормы(ИмяРеквизита)
    Возврат ЭтотОбъект.ПолучитьРеквизиты().Найти(ИмяРеквизита) <> Неопределено;
КонецФункции

&НаКлиенте
Процедура ВКМ_СуммаАбонентскойПлатыПриИзменении(Элемент)
    Объект.ВКМ_СуммаАбонентскойПлаты = ЭтотОбъект.ВКМ_СуммаАбонентскойПлаты;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
    ЭтотОбъект.ВКМ_СуммаАбонентскойПлаты = ТекущийОбъект.ВКМ_СуммаАбонентскойПлаты;
КонецПроцедуры



//&НаСервере
//Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//   Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда 
//    //СоздатьГруппуАбонент();
//    ДобавитьРеквизитыДляАбонента();
//   
//КонецЕсли;	
//КонецПроцедуры	


  //&НаСервере
  //Процедура ДобавитьРеквизитыДляАбонента();
  //  //  ДобавляемыеРеквизиты = Новый Массив;
  //  //Реквизит = Новый РеквизитФормы("ДинамическийРеквизит", Новый ОписаниеТипов("Строка"), , "Дин. реквизит");
  //  //ДобавляемыеРеквизиты.Добавить(Реквизит);
  //  //
  //  //ИзменитьРеквизиты(ДобавляемыеРеквизиты);
  //  //
  //    Если Элементы.Найти("ГруппаПрограммноСозданныеЭлементыФормы") = Неопределено Тогда
  //  	ГруппаПрограммноСозданныеЭлементыФормы = Элементы.Добавить("ГруппаПрограммноСозданныеЭлементыФормы", Тип("ГруппаФормы"),ЭтотОбъект);
  //  	ГруппаПрограммноСозданныеЭлементыФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
  //  	ГруппаПрограммноСозданныеЭлементыФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
  //  	ГруппаПрограммноСозданныеЭлементыФормы.ОтображатьЗаголовок = Ложь;
  //  	ГруппаПрограммноСозданныеЭлементыФормы.Отображение = ОтображениеОбычнойГруппы.Нет; 
  //  КонецЕсли;
  //    	
  //	Если Элементы.Найти("ВКМ_СуммаАбонентскойПлаты") = Неопределено Тогда
  //  	НовыйЭлемент = Элементы.Добавить("СуммаАбонентскойПлаты", Тип("ПолеФормы"),ГруппаПрограммноСозданныеЭлементыФормы);		
  //  	НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
  //  	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
  //  	НовыйЭлемент.Заголовок = "Сумма абонентской платы"; 
  //     
  //  КонецЕсли;
  // УстановитьВидимостьНовыхЭлементовФормы(ЭтотОбъект);
  //
  //КонецПроцедуры

//&НаКлиенте
//  Процедура ВидДоговораПриИзменении(Элемент)
//       Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда 
//    //СоздатьГруппуАбонент();
//    ДобавитьРеквизитыДляАбонента();
//   КонецЕсли; 
//    КонецПроцедуры
  
//    
//		Если Элементы.Найти("ВКМ_СуммаАбонентскойПлаты") = Неопределено Тогда
//		НовыйЭлемент = Элементы.Добавить("СуммаАбонентскойПлаты", Тип("ПолеФормы"),ГруппаАбонент);		
//		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
//		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
//		НовыйЭлемент.Заголовок = "Сумма абонентской платы"; 
//	КонецЕсли;
//	
//	//Если Элементы.Найти("СтоимостьЧасаРаботыСпециалиста") = Неопределено Тогда
//		//НовыйЭлемент = Элементы.Добавить("СтоимостьЧасаРаботы", Тип("ПолеФормы"), ГруппаАбонент);		
//		//НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботыСпециалиста";
//		//НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
//		//НовыйЭлемент.Заголовок = "Стоимость часа работы специалиста";  
//	//КонецЕсли;
//			
//	//Если Элементы.Найти("ПериодДействияДоговора") = Неопределено Тогда
//		//НовыйЭлемент = Элементы.Добавить("ПериодДействияДоговора", Тип("ПолеФормы"),ГруппаАбонент);		
//		//НовыйЭлемент.ПутьКДанным = "ПериодДействияДоговора";
//		//НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
//	//	НовыйЭлемент.Заголовок = "Период действия договора";
//	//КонецЕсли;
//	
//    //Элементы.ВидДоговора.УстановитьДействие("ПриИзменении", "ВидДоговораПриИзменении");
//	УстановитьВидимостьНовыхЭлементовФормы(ЭтотОбъект);		
//КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьНовыхЭлементовФормы(Форма)     
	
	Форма.Элементы.ГруппаПрограммноСозданныеЭлементыФормы.Видимость =  Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
   Объект.ВКМ_СуммаАбонентскойПлаты = ЭтотОбъект.ВКМ_СуммаАбонентскойПлаты;
КонецПроцедуры

//&НаКлиенте
//Процедура ВидДоговораПриИзменении(Элемент)
//    УстановитьВидимостьНовыхЭлементовФормы(ЭтотОбъект);
//КонецПроцедуры




// дубликат
//&НаСервере
//Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//	ДобавитьРеквизитыДляАбонента();
//	
//КонецПроцедуры	
//&НаКлиенте
//Процедура ВидДоговораПриИзменении(Элемент)
//	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
//		ДобавитьРеквизитыДляАбонента();
//	КонецЕсли;	
//КонецПроцедуры	
//&НаСервере
//Процедура ДобавитьРеквизитыДляАбонента()
//	ГруппаАбонент = Элементы.Найти("ГруппаАбонент");
//	Если ГруппаАбонент = Неопределено Тогда
//	ГруппаАбонент = Элементы.Добавить("ГруппаАбонент",Тип("ГруппаФормы"),ЭтотОбъект);
//		ГруппаАбонент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
//		ГруппаАбонент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
//		ГруппаАбонент.ОтображатьЗаголовок = Ложь;
//		ГруппаАбонент.Отображение = ОтображениеОбычнойГруппы.Нет; 	
//	КонецЕсли;
//		
//		Если Элементы.Найти("ВКМ_СуммаАбонентскойПлаты") = Неопределено Тогда
//		НовыйЭлемент = Элементы.Добавить("СуммаАбонентскойПлаты", Тип("ПолеФормы"),ГруппаАбонент);		
//		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
//		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
//		НовыйЭлемент.Заголовок = "Сумма абонентской платы"; 
//	КонецЕсли;
//	
//	//Если Элементы.Найти("СтоимостьЧасаРаботыСпециалиста") = Неопределено Тогда
//		//НовыйЭлемент = Элементы.Добавить("СтоимостьЧасаРаботы", Тип("ПолеФормы"), ГруппаАбонент);		
//		//НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботыСпециалиста";
//		//НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
//		//НовыйЭлемент.Заголовок = "Стоимость часа работы специалиста";  
//	//КонецЕсли;
//			
//	//Если Элементы.Найти("ПериодДействияДоговора") = Неопределено Тогда
//		//НовыйЭлемент = Элементы.Добавить("ПериодДействияДоговора", Тип("ПолеФормы"),ГруппаАбонент);		
//		//НовыйЭлемент.ПутьКДанным = "ПериодДействияДоговора";
//		//НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
//	//	НовыйЭлемент.Заголовок = "Период действия договора";
//	//КонецЕсли;
//	
//	Элементы.ВидДоговора.УстановитьДействие("ПриИзменении", "ВидДоговораПриИзменении");
//	УстановитьВидимостьНовыхЭлементовФормы(ЭтотОбъект);		
//КонецПроцедуры

//&НаКлиентеНаСервереБезКонтекста
//Процедура УстановитьВидимостьНовыхЭлементовФормы(Форма)     