&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДобавитьРеквизитыДляАбонента();
	
КонецПроцедуры	
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		//ДобавитьРеквизитыДляАбонента();
		УстановитьВидимостьНовыхЭлементовФормы(Форма)
	Иначе
		Отказ;
	КонецЕсли;	
КонецПроцедуры	
&НаСервере
Процедура ДобавитьРеквизитыДляАбонента()
	ГруппаАбонент = Элементы.Найти("ГруппаАбонент");
	Если ГруппаАбонент = Неопределено Тогда
	ГруппаАбонент = Элементы.Добавить("ГруппаАбонент",Тип("ГруппаФормы"),ЭтотОбъект);
		ГруппаАбонент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаАбонент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		ГруппаАбонент.ОтображатьЗаголовок = Ложь;
		ГруппаАбонент.Отображение = ОтображениеОбычнойГруппы.Нет; 	
	КонецЕсли;
		
		Если Элементы.Найти("ВКМ_СуммаАбонентскойПлаты") = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить("СуммаАбонентскойПлаты", Тип("ПолеФормы"),ГруппаАбонент);		
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Сумма абонентской платы"; 
	КонецЕсли;
	
	//Если Элементы.Найти("СтоимостьЧасаРаботыСпециалиста") = Неопределено Тогда
		//НовыйЭлемент = Элементы.Добавить("СтоимостьЧасаРаботы", Тип("ПолеФормы"), ГруппаАбонент);		
		//НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботыСпециалиста";
		//НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		//НовыйЭлемент.Заголовок = "Стоимость часа работы специалиста";  
	//КонецЕсли;
			
	//Если Элементы.Найти("ПериодДействияДоговора") = Неопределено Тогда
		//НовыйЭлемент = Элементы.Добавить("ПериодДействияДоговора", Тип("ПолеФормы"),ГруппаАбонент);		
		//НовыйЭлемент.ПутьКДанным = "ПериодДействияДоговора";
		//НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	//	НовыйЭлемент.Заголовок = "Период действия договора";
	//КонецЕсли;
	
	Элементы.ВидДоговора.УстановитьДействие("ПриИзменении", "ВидДоговораПриИзменении");
	УстановитьВидимостьНовыхЭлементовФормы(ЭтотОбъект);		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьНовыхЭлементовФормы(Форма)     
	
	Форма.Элементы.ГруппаАбонент.Видимость =  Истина;
	
КонецПроцедуры

